GopalSaraf/Practicals/PSDL/include/proc/pic18f14k22lin.h
// Register: IOCB
#define IOCB IOCB
extern volatile unsigned char           IOCB                __at(0xF7A);
#ifndef _LIB_BUILD
asm("IOCB equ 0F7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned IOCB                   :4;
    };
    struct {
        unsigned                        :4;
        unsigned IOCB4                  :1;
        unsigned IOCB5                  :1;
        unsigned IOCB6                  :1;
        unsigned IOCB7                  :1;
    };
} IOCBbits_t;
extern volatile IOCBbits_t IOCBbits __at(0xF7A);
// bitfield macros
#define _IOCB_IOCB_POSN                                     0x4
#define _IOCB_IOCB_POSITION                                 0x4
#define _IOCB_IOCB_SIZE                                     0x4
#define _IOCB_IOCB_LENGTH                                   0x4
#define _IOCB_IOCB_MASK                                     0xF0
#define _IOCB_IOCB4_POSN                                    0x4
#define _IOCB_IOCB4_POSITION                                0x4
#define _IOCB_IOCB4_SIZE                                    0x1
#define _IOCB_IOCB4_LENGTH                                  0x1
#define _IOCB_IOCB4_MASK                                    0x10
#define _IOCB_IOCB5_POSN                                    0x5
#define _IOCB_IOCB5_POSITION                                0x5
#define _IOCB_IOCB5_SIZE                                    0x1
#define _IOCB_IOCB5_LENGTH                                  0x1
#define _IOCB_IOCB5_MASK                                    0x20
#define _IOCB_IOCB6_POSN                                    0x6
#define _IOCB_IOCB6_POSITION                                0x6
#define _IOCB_IOCB6_SIZE                                    0x1
#define _IOCB_IOCB6_LENGTH                                  0x1
#define _IOCB_IOCB6_MASK                                    0x40
#define _IOCB_IOCB7_POSN                                    0x7
#define _IOCB_IOCB7_POSITION                                0x7
#define _IOCB_IOCB7_SIZE                                    0x1
#define _IOCB_IOCB7_LENGTH                                  0x1
#define _IOCB_IOCB7_MASK                                    0x80

// Register: ANSEL
#define ANSEL ANSEL
extern volatile unsigned char           ANSEL               __at(0xF7E);
#ifndef _LIB_BUILD
asm("ANSEL equ 0F7Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL                  :8;
    };
    struct {
        unsigned ANS0                   :1;
        unsigned ANS1                   :1;
        unsigned ANS2                   :1;
        unsigned ANS3                   :1;
        unsigned ANS4                   :1;
        unsigned ANS5                   :1;
        unsigned ANS6                   :1;
        unsigned ANS7                   :1;
    };
    struct {
        unsigned ANSEL0                 :1;
        unsigned ANSEL1                 :1;
        unsigned ANSEL2                 :1;
        unsigned ANSEL3                 :1;
        unsigned ANSEL4                 :1;
        unsigned ANSEL5                 :1;
        unsigned ANSEL6                 :1;
        unsigned ANSEL7                 :1;
    };
} ANSELbits_t;
extern volatile ANSELbits_t ANSELbits __at(0xF7E);
// bitfield macros
#define _ANSEL_ANSEL_POSN                                   0x0
#define _ANSEL_ANSEL_POSITION                               0x0
#define _ANSEL_ANSEL_SIZE                                   0x8
#define _ANSEL_ANSEL_LENGTH                                 0x8
#define _ANSEL_ANSEL_MASK                                   0xFF
#define _ANSEL_ANS0_POSN                                    0x0
#define _ANSEL_ANS0_POSITION                                0x0
#define _ANSEL_ANS0_SIZE                                    0x1
#define _ANSEL_ANS0_LENGTH                                  0x1
#define _ANSEL_ANS0_MASK                                    0x1
#define _ANSEL_ANS1_POSN                                    0x1
#define _ANSEL_ANS1_POSITION                                0x1
#define _ANSEL_ANS1_SIZE                                    0x1
#define _ANSEL_ANS1_LENGTH                                  0x1
#define _ANSEL_ANS1_MASK                                    0x2
#define _ANSEL_ANS2_POSN                                    0x2
#define _ANSEL_ANS2_POSITION                                0x2
#define _ANSEL_ANS2_SIZE                                    0x1
#define _ANSEL_ANS2_LENGTH                                  0x1
#define _ANSEL_ANS2_MASK                                    0x4
#define _ANSEL_ANS3_POSN                                    0x3
#define _ANSEL_ANS3_POSITION                                0x3
#define _ANSEL_ANS3_SIZE                                    0x1
#define _ANSEL_ANS3_LENGTH                                  0x1
#define _ANSEL_ANS3_MASK                                    0x8
#define _ANSEL_ANS4_POSN                                    0x4
#define _ANSEL_ANS4_POSITION                                0x4
#define _ANSEL_ANS4_SIZE                                    0x1
#define _ANSEL_ANS4_LENGTH                                  0x1
#define _ANSEL_ANS4_MASK                                    0x10
#define _ANSEL_ANS5_POSN                                    0x5
#define _ANSEL_ANS5_POSITION                                0x5
#define _ANSEL_ANS5_SIZE                                    0x1
#define _ANSEL_ANS5_LENGTH                                  0x1
#define _ANSEL_ANS5_MASK                                    0x20
#define _ANSEL_ANS6_POSN                                    0x6
#define _ANSEL_ANS6_POSITION                                0x6
#define _ANSEL_ANS6_SIZE                                    0x1
#define _ANSEL_ANS6_LENGTH                                  0x1
#define _ANSEL_ANS6_MASK                                    0x40
#define _ANSEL_ANS7_POSN                                    0x7
#define _ANSEL_ANS7_POSITION                                0x7
#define _ANSEL_ANS7_SIZE                                    0x1
#define _ANSEL_ANS7_LENGTH                                  0x1
#define _ANSEL_ANS7_MASK                                    0x80
#define _ANSEL_ANSEL0_POSN                                  0x0
#define _ANSEL_ANSEL0_POSITION                              0x0
#define _ANSEL_ANSEL0_SIZE                                  0x1
#define _ANSEL_ANSEL0_LENGTH                                0x1
#define _ANSEL_ANSEL0_MASK                                  0x1
#define _ANSEL_ANSEL1_POSN                                  0x1
#define _ANSEL_ANSEL1_POSITION                              0x1
#define _ANSEL_ANSEL1_SIZE                                  0x1
#define _ANSEL_ANSEL1_LENGTH                                0x1
#define _ANSEL_ANSEL1_MASK                                  0x2
#define _ANSEL_ANSEL2_POSN                                  0x2
#define _ANSEL_ANSEL2_POSITION                              0x2
#define _ANSEL_ANSEL2_SIZE                                  0x1
#define _ANSEL_ANSEL2_LENGTH                                0x1
#define _ANSEL_ANSEL2_MASK                                  0x4
#define _ANSEL_ANSEL3_POSN                                  0x3
#define _ANSEL_ANSEL3_POSITION                              0x3
#define _ANSEL_ANSEL3_SIZE                                  0x1
#define _ANSEL_ANSEL3_LENGTH                                0x1
#define _ANSEL_ANSEL3_MASK                                  0x8
#define _ANSEL_ANSEL4_POSN                                  0x4
#define _ANSEL_ANSEL4_POSITION                              0x4
#define _ANSEL_ANSEL4_SIZE                                  0x1
#define _ANSEL_ANSEL4_LENGTH                                0x1
#define _ANSEL_ANSEL4_MASK                                  0x10
#define _ANSEL_ANSEL5_POSN                                  0x5
#define _ANSEL_ANSEL5_POSITION                              0x5
#define _ANSEL_ANSEL5_SIZE                                  0x1
#define _ANSEL_ANSEL5_LENGTH                                0x1
#define _ANSEL_ANSEL5_MASK                                  0x20
#define _ANSEL_ANSEL6_POSN                                  0x6
#define _ANSEL_ANSEL6_POSITION                              0x6
#define _ANSEL_ANSEL6_SIZE                                  0x1
#define _ANSEL_ANSEL6_LENGTH                                0x1
#define _ANSEL_ANSEL6_MASK                                  0x40
#define _ANSEL_ANSEL7_POSN                                  0x7
#define _ANSEL_ANSEL7_POSITION                              0x7
#define _ANSEL_ANSEL7_SIZE                                  0x1
#define _ANSEL_ANSEL7_LENGTH                                0x1
#define _ANSEL_ANSEL7_MASK                                  0x80

// Register: ANSELH
#define ANSELH ANSELH
extern volatile unsigned char           ANSELH              __at(0xF7F);
#ifndef _LIB_BUILD
asm("ANSELH equ 0F7Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELH                 :4;
    };
    struct {
        unsigned ANS8                   :1;
        unsigned ANS9                   :1;
        unsigned ANS10                  :1;
        unsigned ANS11                  :1;
    };
    struct {
        unsigned ANSEL8                 :1;
        unsigned ANSEL9                 :1;
        unsigned ANSEL10                :1;
        unsigned ANSEL11                :1;
    };
} ANSELHbits_t;
extern volatile ANSELHbits_t ANSELHbits __at(0xF7F);
// bitfield macros
#define _ANSELH_ANSELH_POSN                                 0x0
#define _ANSELH_ANSELH_POSITION                             0x0
#define _ANSELH_ANSELH_SIZE                                 0x4
#define _ANSELH_ANSELH_LENGTH                               0x4
#define _ANSELH_ANSELH_MASK                                 0xF
#define _ANSELH_ANS8_POSN                                   0x0
#define _ANSELH_ANS8_POSITION                               0x0
#define _ANSELH_ANS8_SIZE                                   0x1
#define _ANSELH_ANS8_LENGTH                                 0x1
#define _ANSELH_ANS8_MASK                                   0x1
#define _ANSELH_ANS9_POSN                                   0x1
#define _ANSELH_ANS9_POSITION                               0x1
#define _ANSELH_ANS9_SIZE                                   0x1
#define _ANSELH_ANS9_LENGTH                                 0x1
#define _ANSELH_ANS9_MASK                                   0x2
#define _ANSELH_ANS10_POSN                                  0x2
#define _ANSELH_ANS10_POSITION                              0x2
#define _ANSELH_ANS10_SIZE                                  0x1
#define _ANSELH_ANS10_LENGTH                                0x1
#define _ANSELH_ANS10_MASK                                  0x4
#define _ANSELH_ANS11_POSN                                  0x3
#define _ANSELH_ANS11_POSITION                              0x3
#define _ANSELH_ANS11_SIZE                                  0x1
#define _ANSELH_ANS11_LENGTH                                0x1
#define _ANSELH_ANS11_MASK                                  0x8
#define _ANSELH_ANSEL8_POSN                                 0x0
#define _ANSELH_ANSEL8_POSITION                             0x0
#define _ANSELH_ANSEL8_SIZE                                 0x1
#define _ANSELH_ANSEL8_LENGTH                               0x1
#define _ANSELH_ANSEL8_MASK                                 0x1
#define _ANSELH_ANSEL9_POSN                                 0x1
#define _ANSELH_ANSEL9_POSITION                             0x1
#define _ANSELH_ANSEL9_SIZE                                 0x1
#define _ANSELH_ANSEL9_LENGTH                               0x1
#define _ANSELH_ANSEL9_MASK                                 0x2
#define _ANSELH_ANSEL10_POSN                                0x2
#define _ANSELH_ANSEL10_POSITION                            0x2
#define _ANSELH_ANSEL10_SIZE                                0x1
#define _ANSELH_ANSEL10_LENGTH                              0x1
#define _ANSELH_ANSEL10_MASK                                0x4
#define _ANSELH_ANSEL11_POSN                                0x3
#define _ANSELH_ANSEL11_POSITION                            0x3
#define _ANSELH_ANSEL11_SIZE                                0x1
#define _ANSELH_ANSEL11_LENGTH                              0x1
#define _ANSELH_ANSEL11_MASK                                0x8

// Register: PORTA
#define PORTA PORTA
extern volatile unsigned char           PORTA               __at(0xF80);
#ifndef _LIB_BUILD
asm("PORTA equ 0F80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
    };
    struct {
        unsigned AN0                    :1;
        unsigned AN1                    :1;
        unsigned AN2                    :1;
        unsigned MCLR                   :1;
        unsigned AN3                    :1;
        unsigned T13CKI                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_MCLR               :1;
    };
    struct {
        unsigned CVREF                  :1;
        unsigned C12IN0M                :1;
        unsigned C1OUT                  :1;
        unsigned nMCLR                  :1;
        unsigned OSC2                   :1;
        unsigned OSC1                   :1;
    };
    struct {
        unsigned VREFM                  :1;
        unsigned VREFP                  :1;
        unsigned T0CKI                  :1;
        unsigned                        :1;
        unsigned CLKOUT                 :1;
        unsigned CLKIN                  :1;
    };
    struct {
        unsigned INT0                   :1;
        unsigned INT1                   :1;
        unsigned INT2                   :1;
    };
    struct {
        unsigned PGD                    :1;
        unsigned PGC                    :1;
        unsigned                        :1;
        unsigned VPP                    :1;
    };
    struct {
        unsigned C1INP                  :1;
        unsigned                        :1;
        unsigned SRQ                    :1;
    };
    struct {
        unsigned ULPWUIN                :1;
        unsigned                        :4;
        unsigned LVDIN                  :1;
    };
} PORTAbits_t;
