GopalSaraf/Practicals/PSDL/include/proc/pic18f14k22lin.h
extern volatile PORTCbits_t PORTCbits __at(0xF82);
// bitfield macros
#define _PORTC_NOT_LINRESET_POSN                            0x7
#define _PORTC_NOT_LINRESET_POSITION                        0x7
#define _PORTC_NOT_LINRESET_SIZE                            0x1
#define _PORTC_NOT_LINRESET_LENGTH                          0x1
#define _PORTC_NOT_LINRESET_MASK                            0x80
#define _PORTC_RC0_POSN                                     0x0
#define _PORTC_RC0_POSITION                                 0x0
#define _PORTC_RC0_SIZE                                     0x1
#define _PORTC_RC0_LENGTH                                   0x1
#define _PORTC_RC0_MASK                                     0x1
#define _PORTC_RC1_POSN                                     0x1
#define _PORTC_RC1_POSITION                                 0x1
#define _PORTC_RC1_SIZE                                     0x1
#define _PORTC_RC1_LENGTH                                   0x1
#define _PORTC_RC1_MASK                                     0x2
#define _PORTC_RC2_POSN                                     0x2
#define _PORTC_RC2_POSITION                                 0x2
#define _PORTC_RC2_SIZE                                     0x1
#define _PORTC_RC2_LENGTH                                   0x1
#define _PORTC_RC2_MASK                                     0x4
#define _PORTC_RC3_POSN                                     0x3
#define _PORTC_RC3_POSITION                                 0x3
#define _PORTC_RC3_SIZE                                     0x1
#define _PORTC_RC3_LENGTH                                   0x1
#define _PORTC_RC3_MASK                                     0x8
#define _PORTC_RC4_POSN                                     0x4
#define _PORTC_RC4_POSITION                                 0x4
#define _PORTC_RC4_SIZE                                     0x1
#define _PORTC_RC4_LENGTH                                   0x1
#define _PORTC_RC4_MASK                                     0x10
#define _PORTC_RC5_POSN                                     0x5
#define _PORTC_RC5_POSITION                                 0x5
#define _PORTC_RC5_SIZE                                     0x1
#define _PORTC_RC5_LENGTH                                   0x1
#define _PORTC_RC5_MASK                                     0x20
#define _PORTC_nLINRESET_POSN                               0x7
#define _PORTC_nLINRESET_POSITION                           0x7
#define _PORTC_nLINRESET_SIZE                               0x1
#define _PORTC_nLINRESET_LENGTH                             0x1
#define _PORTC_nLINRESET_MASK                               0x80
#define _PORTC_AN4_POSN                                     0x0
#define _PORTC_AN4_POSITION                                 0x0
#define _PORTC_AN4_SIZE                                     0x1
#define _PORTC_AN4_LENGTH                                   0x1
#define _PORTC_AN4_MASK                                     0x1
#define _PORTC_AN5_POSN                                     0x1
#define _PORTC_AN5_POSITION                                 0x1
#define _PORTC_AN5_SIZE                                     0x1
#define _PORTC_AN5_LENGTH                                   0x1
#define _PORTC_AN5_MASK                                     0x2
#define _PORTC_AN6_POSN                                     0x2
#define _PORTC_AN6_POSITION                                 0x2
#define _PORTC_AN6_SIZE                                     0x1
#define _PORTC_AN6_LENGTH                                   0x1
#define _PORTC_AN6_MASK                                     0x4
#define _PORTC_AN7_POSN                                     0x3
#define _PORTC_AN7_POSITION                                 0x3
#define _PORTC_AN7_SIZE                                     0x1
#define _PORTC_AN7_LENGTH                                   0x1
#define _PORTC_AN7_MASK                                     0x8
#define _PORTC_RC6_POSN                                     0x6
#define _PORTC_RC6_POSITION                                 0x6
#define _PORTC_RC6_SIZE                                     0x1
#define _PORTC_RC6_LENGTH                                   0x1
#define _PORTC_RC6_MASK                                     0x40
#define _PORTC_RC7_POSN                                     0x7
#define _PORTC_RC7_POSITION                                 0x7
#define _PORTC_RC7_SIZE                                     0x1
#define _PORTC_RC7_LENGTH                                   0x1
#define _PORTC_RC7_MASK                                     0x80
#define _PORTC_C12INP_POSN                                  0x0
#define _PORTC_C12INP_POSITION                              0x0
#define _PORTC_C12INP_SIZE                                  0x1
#define _PORTC_C12INP_LENGTH                                0x1
#define _PORTC_C12INP_MASK                                  0x1
#define _PORTC_C12IN1M_POSN                                 0x1
#define _PORTC_C12IN1M_POSITION                             0x1
#define _PORTC_C12IN1M_SIZE                                 0x1
#define _PORTC_C12IN1M_LENGTH                               0x1
#define _PORTC_C12IN1M_MASK                                 0x2
#define _PORTC_C12IN2M_POSN                                 0x2
#define _PORTC_C12IN2M_POSITION                             0x2
#define _PORTC_C12IN2M_SIZE                                 0x1
#define _PORTC_C12IN2M_LENGTH                               0x1
#define _PORTC_C12IN2M_MASK                                 0x4
#define _PORTC_C12IN3M_POSN                                 0x3
#define _PORTC_C12IN3M_POSITION                             0x3
#define _PORTC_C12IN3M_SIZE                                 0x1
#define _PORTC_C12IN3M_LENGTH                               0x1
#define _PORTC_C12IN3M_MASK                                 0x8
#define _PORTC_C12OUT_POSN                                  0x4
#define _PORTC_C12OUT_POSITION                              0x4
#define _PORTC_C12OUT_SIZE                                  0x1
#define _PORTC_C12OUT_LENGTH                                0x1
#define _PORTC_C12OUT_MASK                                  0x10
#define _PORTC_LINRESET_POSN                                0x7
#define _PORTC_LINRESET_POSITION                            0x7
#define _PORTC_LINRESET_SIZE                                0x1
#define _PORTC_LINRESET_LENGTH                              0x1
#define _PORTC_LINRESET_MASK                                0x80
#define _PORTC_P1D_POSN                                     0x2
#define _PORTC_P1D_POSITION                                 0x2
#define _PORTC_P1D_SIZE                                     0x1
#define _PORTC_P1D_LENGTH                                   0x1
#define _PORTC_P1D_MASK                                     0x4
#define _PORTC_P1C_POSN                                     0x3
#define _PORTC_P1C_POSITION                                 0x3
#define _PORTC_P1C_SIZE                                     0x1
#define _PORTC_P1C_LENGTH                                   0x1
#define _PORTC_P1C_MASK                                     0x8
#define _PORTC_P1B_POSN                                     0x4
#define _PORTC_P1B_POSITION                                 0x4
#define _PORTC_P1B_SIZE                                     0x1
#define _PORTC_P1B_LENGTH                                   0x1
#define _PORTC_P1B_MASK                                     0x10
#define _PORTC_P1A_POSN                                     0x5
#define _PORTC_P1A_POSITION                                 0x5
#define _PORTC_P1A_SIZE                                     0x1
#define _PORTC_P1A_LENGTH                                   0x1
#define _PORTC_P1A_MASK                                     0x20
#define _PORTC_C2INP_POSN                                   0x0
#define _PORTC_C2INP_POSITION                               0x0
#define _PORTC_C2INP_SIZE                                   0x1
#define _PORTC_C2INP_LENGTH                                 0x1
#define _PORTC_C2INP_MASK                                   0x1
#define _PORTC_PGM_POSN                                     0x3
#define _PORTC_PGM_POSITION                                 0x3
#define _PORTC_PGM_SIZE                                     0x1
#define _PORTC_PGM_LENGTH                                   0x1
#define _PORTC_PGM_MASK                                     0x8
#define _PORTC_C2OUT_POSN                                   0x4
#define _PORTC_C2OUT_POSITION                               0x4
#define _PORTC_C2OUT_SIZE                                   0x1
#define _PORTC_C2OUT_LENGTH                                 0x1
#define _PORTC_C2OUT_MASK                                   0x10
#define _PORTC_CCP1_POSN                                    0x5
#define _PORTC_CCP1_POSITION                                0x5
#define _PORTC_CCP1_SIZE                                    0x1
#define _PORTC_CCP1_LENGTH                                  0x1
#define _PORTC_CCP1_MASK                                    0x20
#define _PORTC_CCP2_POSN                                    0x1
#define _PORTC_CCP2_POSITION                                0x1
#define _PORTC_CCP2_SIZE                                    0x1
#define _PORTC_CCP2_LENGTH                                  0x1
#define _PORTC_CCP2_MASK                                    0x2
#define _PORTC_PA1_POSN                                     0x2
#define _PORTC_PA1_POSITION                                 0x2
#define _PORTC_PA1_SIZE                                     0x1
#define _PORTC_PA1_LENGTH                                   0x1
#define _PORTC_PA1_MASK                                     0x4
#define _PORTC_PA2_POSN                                     0x1
#define _PORTC_PA2_POSITION                                 0x1
#define _PORTC_PA2_SIZE                                     0x1
#define _PORTC_PA2_LENGTH                                   0x1
#define _PORTC_PA2_MASK                                     0x2

