GopalSaraf/Practicals/PSDL/include/proc/pic18f14k22lin.h
extern volatile PSTRCONbits_t PSTRCONbits __at(0xFB9);
// bitfield macros
#define _PSTRCON_STRA_POSN                                  0x0
#define _PSTRCON_STRA_POSITION                              0x0
#define _PSTRCON_STRA_SIZE                                  0x1
#define _PSTRCON_STRA_LENGTH                                0x1
#define _PSTRCON_STRA_MASK                                  0x1
#define _PSTRCON_STRB_POSN                                  0x1
#define _PSTRCON_STRB_POSITION                              0x1
#define _PSTRCON_STRB_SIZE                                  0x1
#define _PSTRCON_STRB_LENGTH                                0x1
#define _PSTRCON_STRB_MASK                                  0x2
#define _PSTRCON_STRC_POSN                                  0x2
#define _PSTRCON_STRC_POSITION                              0x2
#define _PSTRCON_STRC_SIZE                                  0x1
#define _PSTRCON_STRC_LENGTH                                0x1
#define _PSTRCON_STRC_MASK                                  0x4
#define _PSTRCON_STRD_POSN                                  0x3
#define _PSTRCON_STRD_POSITION                              0x3
#define _PSTRCON_STRD_SIZE                                  0x1
#define _PSTRCON_STRD_LENGTH                                0x1
#define _PSTRCON_STRD_MASK                                  0x8
#define _PSTRCON_STRSYNC_POSN                               0x4
#define _PSTRCON_STRSYNC_POSITION                           0x4
#define _PSTRCON_STRSYNC_SIZE                               0x1
#define _PSTRCON_STRSYNC_LENGTH                             0x1
#define _PSTRCON_STRSYNC_MASK                               0x10

// Register: VREFCON0
#define VREFCON0 VREFCON0
extern volatile unsigned char           VREFCON0            __at(0xFBA);
#ifndef _LIB_BUILD
asm("VREFCON0 equ 0FBAh");
#endif
// aliases
extern volatile unsigned char           REFCON0             __at(0xFBA);
#ifndef _LIB_BUILD
asm("REFCON0 equ 0FBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned                        :1;
        unsigned FVR1S0                 :1;
        unsigned FVR1S1                 :1;
        unsigned FVR1ST                 :1;
        unsigned FVR1EN                 :1;
    };
} VREFCON0bits_t;
extern volatile VREFCON0bits_t VREFCON0bits __at(0xFBA);
// bitfield macros
#define _VREFCON0_FVR1S0_POSN                               0x4
#define _VREFCON0_FVR1S0_POSITION                           0x4
#define _VREFCON0_FVR1S0_SIZE                               0x1
#define _VREFCON0_FVR1S0_LENGTH                             0x1
#define _VREFCON0_FVR1S0_MASK                               0x10
#define _VREFCON0_FVR1S1_POSN                               0x5
#define _VREFCON0_FVR1S1_POSITION                           0x5
#define _VREFCON0_FVR1S1_SIZE                               0x1
#define _VREFCON0_FVR1S1_LENGTH                             0x1
#define _VREFCON0_FVR1S1_MASK                               0x20
#define _VREFCON0_FVR1ST_POSN                               0x6
#define _VREFCON0_FVR1ST_POSITION                           0x6
#define _VREFCON0_FVR1ST_SIZE                               0x1
#define _VREFCON0_FVR1ST_LENGTH                             0x1
#define _VREFCON0_FVR1ST_MASK                               0x40
#define _VREFCON0_FVR1EN_POSN                               0x7
#define _VREFCON0_FVR1EN_POSITION                           0x7
#define _VREFCON0_FVR1EN_SIZE                               0x1
#define _VREFCON0_FVR1EN_LENGTH                             0x1
#define _VREFCON0_FVR1EN_MASK                               0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned                        :1;
        unsigned FVR1S0                 :1;
        unsigned FVR1S1                 :1;
        unsigned FVR1ST                 :1;
        unsigned FVR1EN                 :1;
    };
} REFCON0bits_t;
extern volatile REFCON0bits_t REFCON0bits __at(0xFBA);
// bitfield macros
#define _REFCON0_FVR1S0_POSN                                0x4
#define _REFCON0_FVR1S0_POSITION                            0x4
#define _REFCON0_FVR1S0_SIZE                                0x1
#define _REFCON0_FVR1S0_LENGTH                              0x1
#define _REFCON0_FVR1S0_MASK                                0x10
#define _REFCON0_FVR1S1_POSN                                0x5
#define _REFCON0_FVR1S1_POSITION                            0x5
#define _REFCON0_FVR1S1_SIZE                                0x1
#define _REFCON0_FVR1S1_LENGTH                              0x1
#define _REFCON0_FVR1S1_MASK                                0x20
#define _REFCON0_FVR1ST_POSN                                0x6
#define _REFCON0_FVR1ST_POSITION                            0x6
#define _REFCON0_FVR1ST_SIZE                                0x1
#define _REFCON0_FVR1ST_LENGTH                              0x1
#define _REFCON0_FVR1ST_MASK                                0x40
#define _REFCON0_FVR1EN_POSN                                0x7
#define _REFCON0_FVR1EN_POSITION                            0x7
#define _REFCON0_FVR1EN_SIZE                                0x1
#define _REFCON0_FVR1EN_LENGTH                              0x1
#define _REFCON0_FVR1EN_MASK                                0x80

// Register: VREFCON1
#define VREFCON1 VREFCON1
extern volatile unsigned char           VREFCON1            __at(0xFBB);
#ifndef _LIB_BUILD
asm("VREFCON1 equ 0FBBh");
#endif
// aliases
extern volatile unsigned char           REFCON1             __at(0xFBB);
#ifndef _LIB_BUILD
asm("REFCON1 equ 0FBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D1NSS                  :1;
        unsigned                        :1;
        unsigned D1PSS                  :2;
        unsigned                        :1;
        unsigned DAC1OE                 :1;
        unsigned D1LPS                  :1;
        unsigned D1EN                   :1;
    };
    struct {
        unsigned D1NSS0                 :1;
        unsigned                        :1;
        unsigned D1PSS0                 :1;
        unsigned D1PSS1                 :1;
    };
} VREFCON1bits_t;
extern volatile VREFCON1bits_t VREFCON1bits __at(0xFBB);
// bitfield macros
#define _VREFCON1_D1NSS_POSN                                0x0
#define _VREFCON1_D1NSS_POSITION                            0x0
#define _VREFCON1_D1NSS_SIZE                                0x1
#define _VREFCON1_D1NSS_LENGTH                              0x1
#define _VREFCON1_D1NSS_MASK                                0x1
#define _VREFCON1_D1PSS_POSN                                0x2
#define _VREFCON1_D1PSS_POSITION                            0x2
#define _VREFCON1_D1PSS_SIZE                                0x2
#define _VREFCON1_D1PSS_LENGTH                              0x2
#define _VREFCON1_D1PSS_MASK                                0xC
#define _VREFCON1_DAC1OE_POSN                               0x5
#define _VREFCON1_DAC1OE_POSITION                           0x5
#define _VREFCON1_DAC1OE_SIZE                               0x1
#define _VREFCON1_DAC1OE_LENGTH                             0x1
#define _VREFCON1_DAC1OE_MASK                               0x20
#define _VREFCON1_D1LPS_POSN                                0x6
#define _VREFCON1_D1LPS_POSITION                            0x6
#define _VREFCON1_D1LPS_SIZE                                0x1
#define _VREFCON1_D1LPS_LENGTH                              0x1
#define _VREFCON1_D1LPS_MASK                                0x40
#define _VREFCON1_D1EN_POSN                                 0x7
#define _VREFCON1_D1EN_POSITION                             0x7
#define _VREFCON1_D1EN_SIZE                                 0x1
#define _VREFCON1_D1EN_LENGTH                               0x1
#define _VREFCON1_D1EN_MASK                                 0x80
#define _VREFCON1_D1NSS0_POSN                               0x0
#define _VREFCON1_D1NSS0_POSITION                           0x0
#define _VREFCON1_D1NSS0_SIZE                               0x1
#define _VREFCON1_D1NSS0_LENGTH                             0x1
#define _VREFCON1_D1NSS0_MASK                               0x1
#define _VREFCON1_D1PSS0_POSN                               0x2
#define _VREFCON1_D1PSS0_POSITION                           0x2
#define _VREFCON1_D1PSS0_SIZE                               0x1
#define _VREFCON1_D1PSS0_LENGTH                             0x1
#define _VREFCON1_D1PSS0_MASK                               0x4
#define _VREFCON1_D1PSS1_POSN                               0x3
#define _VREFCON1_D1PSS1_POSITION                           0x3
#define _VREFCON1_D1PSS1_SIZE                               0x1
#define _VREFCON1_D1PSS1_LENGTH                             0x1
#define _VREFCON1_D1PSS1_MASK                               0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned D1NSS                  :1;
        unsigned                        :1;
        unsigned D1PSS                  :2;
        unsigned                        :1;
        unsigned DAC1OE                 :1;
        unsigned D1LPS                  :1;
        unsigned D1EN                   :1;
    };
    struct {
        unsigned D1NSS0                 :1;
        unsigned                        :1;
        unsigned D1PSS0                 :1;
        unsigned D1PSS1                 :1;
    };
} REFCON1bits_t;
